Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.GetRevisions Method
 Gets the reference models available revisions.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<ReferenceModel.Revision> GetRevisions()
Public Function GetRevisions As List(Of ReferenceModel.Revision)
Return Value
Type: List<ReferenceModel.Revision>
[Missing <returns> documentation for "M:Tekla.Structures.Model.ReferenceModel.GetRevisions"]
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace